{
  "contract-1.pdf": "\nPREMIUM FLOUR MILLS\n\n# SUPPLY AGREEMENT CONTRACT\n\nContract No.: PFM-SB-2025-001 | Rev. 1.0 EXECUTED\n\n# AGREEMENT DATE\n\nTHIS AGREEMENT is made and entered into on this 5th day of January, 2025\n\n# CONTRACTING PARTIES\n\n# SUPPLIER:\n\nPremium Flour Mills, Inc.\n\n1234 Grain Road\n\nMill Valley, California 94941\n\nTax ID: 12-3456789\n\n# BUYER:\n\nSunshine Bakery LLC\n\n567 Main Street\n\nSan Francisco, California 94110\n\nTax ID: 98-7654321\n\n# TERMS AND CONDITIONS\n\n# 1. PRODUCTS AND PRICING:\n\nThe SUPPLIER agrees to provide the following products to the BUYER at the prices specified below, subject to the terms and conditions outlined in this Agreement:\n\n| Item Code | Product Description | Unit Size | Price (USD) | Origin            |\n| --------- | ------------------- | --------- | ----------- | ----------------- |\n| APF-50    | All-Purpose Flour   | 50 lb bag | $32.75      | Domestic          |\n| WWF-50    | Whole Wheat Flour   | 50 lb bag | $36.50      | Domestic          |\n| BRF-50    | Bread Flour         | 50 lb bag | $34.25      | Domestic          |\n| PSF-50    | Pastry Flour        | 50 lb bag | $38.95      | Domestic          |\n| ORF-50    | Organic Rye Flour   | 50 lb bag | $42.75      | Organic Certified |\n\n\n\n\n\n# 2. VOLUME DISCOUNTS:\n\nThe BUYER is entitled to the following volume discounts based on the number of bags ordered per single purchase order:\n\n| Order Volume | Discount Rate |\n| ------------ | ------------- |\n| 10-24 bags   | 3% discount   |\n| 25-49 bags   | 5% discount   |\n| 50+ bags     | 8% discount   |\n\n2.1 Discounts apply to the total pre-tax invoice amount.\n\n2.2 Discounts cannot be combined with other promotional offers unless explicitly stated in writing.\n\n2.3 Volume discounts will be applied automatically based on the order quantity.\n\n# 3. DELIVERY:\n\nThe SUPPLIER agrees to deliver products to the BUYER's facility on a weekly basis, scheduled for Monday mornings before 10:00 AM.\n\n3.1 CONFIDENTIAL\n\nDelivery address: 567 Main Street, San Francisco, CA 94110.\n\n3.2 In the event that a Monday falls on a national holiday, delivery will be made on the next business day.\n\n3.3 The BUYER must have personnel available to receive deliveries during the specified delivery window.\n\n3.4 Title and risk of loss shall pass to the BUYER upon completion of delivery at the BUYER's facility.\n\n# 4. PAYMENT TERMS:\n\nThe BUYER agrees to pay for products within Net 30 days from the invoice date.\n\n4.1 Invoices will be issued on the day of delivery.\n\n4.2 Payments shall be made by check, ACH transfer, or other methods approved by the SUPPLIER.\n\n4.3 Late payments may be subject to a 1.5% monthly interest charge on outstanding balances.\n\n# 5. MINIMUM ORDER:\n\nThe BUYER agrees to order a minimum of 10 bags total per order across any combination of product types.\n\n\n\n# 6. CONTRACT PERIOD:\n\nThis Agreement shall be in effect from January 15, 2025 to January 14, 2026, unless terminated earlier in accordance with the provisions set forth herein.\n\n# 7. PRICE ADJUSTMENT:\n\nThe prices specified in Clause 1 shall remain fixed for the first 6 months of the contract period. Thereafter, the SUPPLIER reserves the right to adjust prices with a maximum increase of 4%, subject to 30 days written notice to the BUYER.\n\n# 7.1\n\nAny price adjustment shall be justified by increases in raw material costs, production costs, or other factors beyond the SUPPLIER's reasonable control.\n\n# 7.2\n\nThe BUYER shall have the right to review documentation supporting the necessity of such price increases.\n\n# 8. QUALITY STANDARDS:\n\nAll products provided under this Agreement must meet or exceed FDA and USDA standards for food grade flour.\n\n# 8.1\n\nThe SUPPLIER shall maintain all necessary certifications and shall provide copies upon request.\n\n# 8.2\n\nThe SUPPLIER shall implement appropriate quality control measures throughout the production process.\n\n# 8.3\n\nThe BUYER reserves the right to inspect the SUPPLIER's production facilities with reasonable notice.\n\n# 9. RETURNS:\n\nThe BUYER may return defective products within 7 days of delivery, subject to inspection and verification by the SUPPLIER.\n\n# 9.1\n\nThe BUYER must notify the SUPPLIER in writing of any defects within 48 hours of discovery.\n\n# 9.2\n\nThe SUPPLIER shall arrange for the retrieval of defective products and provide replacements within a reasonable timeframe.\n\n# 9.3\n\nProducts returned due to BUYER's error shall be subject to a 15% restocking fee.\n\n# 10. TERMINATION:\n\nEither party may terminate this Agreement by providing 60 days written notice to the other party.\n\n# 10.1\n\nThe SUPPLIER may terminate this Agreement immediately in the event of non-payment by the BUYER.\n\n# 10.2\n\nThe BUYER may terminate this Agreement immediately if the SUPPLIER fails to meet the quality standards specified in Clause 8.\n\n# 10.3\n\nAny outstanding invoices shall remain payable regardless of termination.\n\n\n\n\n# FOR AND ON BEHALF OF THE BUYER:\n\n# FOR AND ON BEHALF OF THE SUPPLIER:\n\n| Name: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  | Name: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  |\n| --------------------------------------------------------- | --------------------------------------------------------- |\n| Title: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ | Title: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ |\n| Date: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  | Date: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  |\n\nThis Agreement constitutes the entire understanding between the parties and supersedes all prior negotiations, undertakings, and agreements between the parties. Any modifications must be made in writing and signed by authorized representatives of both parties.\n\n",
  "contract-2.pdf": "\nCONFIDENTIAL\n\n# Fresh Farms\n\nContract #: FF-SB-2024-073\n\nDairy Cooperative Since 1978\n\nRevision: 1.0\n\n# ORIGINAL\n\n# DAIRY SUPPLY AGREEMENT\n\nCommercial - Confidential\n\nThis AGREEMENT is made on this 15th day of December, 2024\n\n# SUPPLIER\n\nFresh Farms Dairy Cooperative (\"Supplier\")\n\n789 Pasture Lane\n\nPetaluma, CA 94952\n\nLicense: CA-DAIRY-78923\n\nTax ID: 45-8761290\n\n# BUYER\n\nSunshine Bakery LLC (\"Buyer\")\n\n567 Main Street\n\nSan Francisco, CA 94110\n\nLicense: SF-FOOD-45871\n\nTax ID: 98-7654321\n\n# WHEREBY:\n\n# ARTICLE 1: PRODUCTS\n\nSupplier shall provide the following products:\n\n| Product Code | Product Description        | Unit Size | Price (USD) | Origin     |\n| ------------ | -------------------------- | --------- | ----------- | ---------- |\n| BU-US-AA     | Butter, Unsalted, Grade AA | 1 lb      | $4.85       | California |\n| BU-SL-AA     | Butter, Salted, Grade AA   | 1 lb      | $4.75       | California |\n\n\n\n\n\n\n| Product Code | Product Description | Unit Size | Price (USD) | Origin     |\n| ------------ | ------------------- | --------- | ----------- | ---------- |\n| HVC-40       | Heavy Cream (40%)   | 1 quart   | $3.95       | California |\n| WM-GAL       | Whole Milk          | 1 gallon  | $3.25       | California |\n| BTM-QT       | Buttermilk          | 1 quart   | $3.65       | California |\n| CRM-CHS      | Cream Cheese        | 1 lb      | $2.95       | California |\n\n# ARTICLE 2: ORDERING\n\n2.1 Orders must be placed by 2:00 PM for next-day delivery.\n\n2.2 Minimum order quantity is $200 per delivery.\n\n2.3 Orders may be placed via the online ordering system, email, or telephone.\n\n2.4 Order confirmation will be provided within 2 hours of order placement during normal business hours.\n\n# ARTICLE 3: DELIVERY\n\n3.1 Deliveries shall be made Monday, Wednesday, and Friday between 5:00 AM and 7:00 AM.\n\n3.2 Products must be maintained at appropriate temperatures during transport.\n\n3.3 Buyer shall provide access to delivery point and inspect products immediately upon receipt.\n\n3.4 Delivery address: 567 Main Street, San Francisco, CA 94110, loading dock entrance.\n\n3.5 Delivery confirmation shall be signed by authorized personnel only.\n\n# ARTICLE 4: PAYMENT\n\n\n\n\n\n# 4.1\n\nPayment terms are Net 15 days from delivery.\n\n# 4.2\n\nLate payments subject to 1.5% interest per month.\n\n# 4.3\n\nRecurring late payments may result in modified payment terms requiring advance payment.\n\n# 4.4\n\nPayments shall be made by check, ACH transfer, or other methods approved by the Supplier.\n\n# 4.5\n\nInvoice disputes must be submitted in writing within 7 days of receipt.\n\n# ARTICLE 5: QUALITY &#x26; RETURNS\n\n# 5.1\n\nAll products guaranteed fresh upon delivery.\n\n# 5.2\n\nAny quality issues must be reported within 24 hours.\n\n# 5.3\n\nCredit for defective products issued within 7 business days.\n\n# 5.4\n\nProducts must be stored at appropriate temperatures by Buyer upon receipt.\n\n# 5.5\n\nSupplier reserves the right to inspect returned products before issuing credit.\n\n# ARTICLE 6: CONTRACT PERIOD\n\nThis agreement commences on January 1, 2025 and continues through December 31, 2025, with automatic renewal for additional one-year periods unless terminated.\n\n# 6.1\n\nEither party may terminate this agreement with 30 days written notice.\n\n# 6.2\n\nTermination notice must be provided in writing via certified mail.\n\n# 6.3\n\nAll outstanding invoices remain due regardless of termination.\n\n# ARTICLE 7: PRICE ADJUSTMENTS\n\nSupplier reserves the right to adjust prices quarterly with 15 days advance notice, based on market conditions.\n\n# 7.1\n\nPrice adjustments shall be communicated in writing with justification.\n\n\n\n\n\n# 7.2\n\nBuyer has the right to terminate this agreement if price increases exceed 10% in any calendar year.\n\n# 7.3\n\nSeasonal promotional pricing may be offered at Supplier's discretion.\n\n| FOR SUPPLIER:                                             | FOR BUYER:                                                |\n| --------------------------------------------------------- | --------------------------------------------------------- |\n| Fresh Farms Dairy Cooperative                             | Sunshine Bakery LLC                                       |\n| Name: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  | Name: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  |\n| Title: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ | Title: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ |\n| Date: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  | Date: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  |\n\nSEAL\n\nThis document contains confidential and proprietary information. Unauthorized reproduction or distribution is strictly prohibited.\n\nPage 1 of 1"
}